// string[,] table = new string [2, 5];

// // String.Empty
// // table[0, 0]    table[0, 1]    table[0, 2]    table[0, 3]      table[0, 4]
// // table[1, 0]    table[1, 1]    "слово"        table[1, 3]      table[1, 4]

// // table[1, 3]  = "слово";


// {
//   for (int rows = 0; rows < 2; rows++)
//   { 
//         for (int columns = 0; columns < 5; columns++)
//         {
//             Console.WriteLine($"-{table[rows, columns]}-");
//         }
//   } 
    
// }

// int [,] matrix = new int[3, 4];



// void PrintArray(int[,] matr)
// {
// for (int i = 0; i < matr.GetLength(0); i++)
// {
//     for (int j = 0; j < matr.GetLength(0); j++)
//     {
//         Console.Write($"{matr[i, j]} ");
//     }
//     Console.WriteLine();
// }

// }

// void FillArray(int[,] matr)
// {
// for (int i = 0; i < matr.GetLength(0); i++)
// {
//     for (int j = 0; j < matr.GetLength(0); j++)
//     {
//         matr[i,j] = new Random().Next(1, 10); // [1, 10) - полуинтервал
//     }

// }
// }
// PrintArray(matrix);
// Console.WriteLine();
// FillArray(matrix);
// PrintArray(matrix);

///////////////////////////////////////////////////////////////////////////


// int[,] pic = new int[,]{ 

// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0},
// {0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0},
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
// };

// void PrintImage(int[,] image)
// {
// for (int i = 0; i < image.GetLength(0); i++)
// {
//     for (int j = 0; j < image.GetLength(0); j++)
//     {
//         if (image[i,j] == 0) Console.Write(" ");
//         else Console.Write("+");
//         // Console.Write($"{image[i, j]} ");
//     }
//     Console.WriteLine();
// }
// }

// void FillImage(int row, int column)
// {
//     if (pic[row, column]==0)
//     {
//        pic[row, column] = 1;
//        FillImage(row-1, column);
//        FillImage(row, column-1);
//        FillImage(row+1, column);
//        FillImage(row, column+1);

//     }
// }

// PrintImage(pic);
// FillImage(13, 13);
// PrintImage(pic);


//////////////////////////////////////////////////////////////////////////


// Console.WriteLine("Введите число N");
// int n = Convert.ToInt32(Console.ReadLine());
// double res = Factorial(n);
// //Console.WriteLine($"{n}! = {res}");

// double Factorial(int n)
// {
//     if (n==1) return 1; // т.к. 1! = 1, также 0! = 1.
//     else return n*Factorial(n-1);
    
// }

// for (int i = 1; i <= n; i++)
//     {
//      Console.WriteLine($"{i}! = {Factorial(i)}");   
//     }

////////////////////////////////////////////////////////////////////////////////


// // Числа Фибоначи //

// int Fibonachi(int n)
// {
//     if (n == 1 || n == 2) return 1;
//     else return Fibonachi(n-1)+Fibonachi(n-2); 
// }

// for (int i = 1; i < 50; i++)
// {
//     Console.WriteLine($"F({i}) = {Fibonachi(i)}");
// }

///////////////////////////////////////////////////////////////////////
